text = """Анекдот 540

Поїхали СТБ знімати репортаж про сільске життя. Знімають інтерв'ю з гуцулом.
— Скажіть, а як ви заробляєте на життя?
— Отару овець маю.
— А скільки у вас овець?
— Білих, чи чорних?
— Білих
— 110
— А чорних?
— Теж 110
— І що, багато з них шерсті збираєте?
— З білих, чи з чорних?
— З білих
— Ну по пару кілограм на сезон є
— А з чорних?
— Та теж
— А годуєте їх чим?
— Білих, чи чорних?
— Білих
— Та просто пасу їх, вони самі траву їдять
— А чорних?
— Теж
— Слухайте, та якщо в них все однакове, то чого ви тоді постійно про білих і чорних окремо говорите?
— Ну так бо білі вівці то мої
— Ааааааа, зрозуміло. А чорні чиї?
— Та теж мої"""

with open("data.txt", "w", encoding="utf-8") as f:
    f.write(text)

print("data.txt створено")